/* ========================================
ストライク_見た目設定
======================================== */

const CONFIG = {

/* ========================================
   ゲージ設定
======================================== */
gauge: {

    // ゲージ上端
    topY: 80,

    // ゲージ下端
    bottomY: 540,

    // 上辺左
    topLeft: 170,

    // 上辺右
    topRight: 330,

    // 下辺左
    bottomLeft: 237,

    // 下辺右
    bottomRight: 263

},

/* ========================================
   バー設定
======================================== */

// 初期バー位置
initialPercent: 70,

// メモリ位置
targetPercent: 80,

// 移動速度
speed: 300,

// 再開までの待機時間(ms)
restartDelay: 2000

};
